# Pandas:-

#.Pandas is a data analysis library ,developed on the top of numpy.
#.Pandas is a python library for working with tabular data.(like: excel sheets,csvs,sql tables)

In [1]:
#In Pandas library there are two types of data structure.
 #   1.Series :- 1D (column)
  #  2.Dataframe :- 2D (Table)

# Installation of Pandas:

In [2]:
pip install pandas.

Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 25.3 -> 26.0
[notice] To update, run: python.exe -m pip install --upgrade pip
ERROR: Invalid requirement: 'pandas.': Expected end or semicolon (after name and no valid version specifier)
    pandas.
          ^

# import pandas:

In [3]:
import pandas as pd

# Creating data using Dictionary:

In [4]:
data = {
    "EmpId": [1001,1002,  1003, 1004, 1005,  1006],
    "EmpName":['Ravi','Priya','Nisha','Disha','Ajay','Vijay'],
    "Salary":[45000,40000,48000,50000,80000,55000]
}
df = pd.DataFrame(data)
df

   EmpId EmpName  Salary
0   1001    Ravi   45000
1   1002   Priya   40000
2   1003   Nisha   48000
3   1004   Disha   50000
4   1005    Ajay   80000
5   1006   Vijay   55000

# Creating dataFrame using .csv file.:

In [5]:
df2 = pd.read_csv("insurance.csv")
df2.head()

,PatientID,age,gender,bmi,bloodpressure,diabetic,children,smoker,region,claim
0,1,39.0,male,23.2,91,Yes,0,No,southeast,1121.87
1,2,24.0,male,30.1,87,No,0,No,southeast,1131.51
2,3,NaN,male,33.3,82,Yes,0,No,southeast,1135.94
3,4,NaN,male,33.7,80,No,0,No,northwest,1136.40
4,5,NaN,male,34.1,100,No,0,No,northwest,1137.01

# Inspecting Data:-

In [6]:
df2.head() # Display first five Rows.

,PatientID,age,gender,bmi,bloodpressure,diabetic,children,smoker,region,claim
0,1,39.0,male,23.2,91,Yes,0,No,southeast,1121.87
1,2,24.0,male,30.1,87,No,0,No,southeast,1131.51
2,3,NaN,male,33.3,82,Yes,0,No,southeast,1135.94
3,4,NaN,male,33.7,80,No,0,No,northwest,1136.40
4,5,NaN,male,34.1,100,No,0,No,northwest,1137.01

In [7]:
df2.tail() # Display last five Rows.

,PatientID,age,gender,bmi,bloodpressure,diabetic,children,smoker,region,claim
1335,1336,44.0,female,35.5,88,Yes,0,Yes,northwest,55135.40
1336,1337,59.0,female,38.1,120,No,1,Yes,northeast,58571.07
1337,1338,30.0,male,34.5,91,Yes,3,Yes,northwest,60021.40
1338,1339,37.0,male,30.4,106,No,0,Yes,southeast,62592.87
1339,1340,30.0,female,47.4,101,No,0,Yes,southeast,63770.43

In [8]:
df2.shape # (Rows,column)

(1340, 10)

In [9]:
df2.columns # display the column name

Index(['PatientID', 'age', 'gender', 'bmi', 'bloodpressure', 'diabetic',
       'children', 'smoker', 'region', 'claim'],
      dtype='object')

In [10]:
df2.info() # Diplay the datatypes and null.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1340 entries, 0 to 1339
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   PatientID      1340 non-null   int64
 1   age            1335 non-null   float64
 2   gender         1340 non-null   object
 3   bmi            1340 non-null   float64
 4   bloodpressure  1340 non-null   int64
 5   diabetic       1340 non-null   object
 6   children       1340 non-null   int64
 7   smoker         1340 non-null   object
 8   region         1337 non-null   object
 9   claim          1340 non-null   float64
dtypes: float64(3), int64(3), object(4)
memory usage: 104.8+ KB

In [11]:
df2.describe() # Stats for numeric columns.

,PatientID,age,bmi,bloodpressure,children,claim
count,1340.000000,1335.000000,1340.000000,1340.000000,1340.000000,1340.000000
mean,670.500000,38.078652,30.668955,94.157463,1.093284,13252.745642
std,386.968991,11.102924,6.106735,11.434712,1.205334,12109.609288
min,1.000000,18.000000,16.000000,80.000000,0.000000,1121.870000
25%,335.750000,29.000000,26.275000,86.000000,0.000000,4719.685000
50%,670.500000,38.000000,30.400000,92.000000,1.000000,9369.615000
75%,1005.250000,47.000000,34.700000,99.000000,2.000000,16604.305000
max,1340.000000,60.000000,53.100000,140.000000,5.000000,63770.430000

# Selecting Data

In [12]:
# Select column
df2["age"] # selct age column from dataFrame.

0       39.0
1       24.0
2        NaN
3        NaN
4        NaN
        ...
1335    44.0
1336    59.0
1337    30.0
1338    37.0
1339    30.0
Name: age, Length: 1340, dtype: float64

# Selecting Multiple columns.

In [13]:
df2[["age","gender"]] # select age and gender column from dataframe.

       age  gender
0     39.0    male
1     24.0    male
2      NaN    male
3      NaN    male
4      NaN    male
...    ...     ...
1335  44.0  female
1336  59.0  female
1337  30.0    male
1338  37.0    male
1339  30.0  female

[1340 rows x 2 columns]

In [14]:
df2[["age","gender","bmi"]].head()

    age gender   bmi
0  39.0   male  23.2
1  24.0   male  30.1
2   NaN   male  33.3
3   NaN   male  33.7
4   NaN   male  34.1

# selecting Rows by Index

In [15]:
df2.loc[0] # loc-location-- label base

PatientID                1
age                   39.0
gender                male
bmi                   23.2
bloodpressure           91
diabetic               Yes
children                 0
smoker                  No
region           southeast
claim              1121.87
Name: 0, dtype: object

In [16]:
df2.iloc[1] # position base.

PatientID                2
age                   24.0
gender                male
bmi                   30.1
bloodpressure           87
diabetic                No
children                 0
smoker                  No
region           southeast
claim              1131.51
Name: 1, dtype: object

# Rows + columns

In [17]:
print(df2.loc[0 , "age"])

39.0

# Filtering Data:-

#  write a code to select data from dataframe with age > 40.

In [18]:
df2[df2["age"]>40]

,PatientID,age,gender,bmi,bloodpressure,diabetic,children,smoker,region,claim
17,18,41.0,male,34.4,84,No,0,No,southwest,1261.86
18,19,49.0,male,35.4,97,Yes,0,No,southwest,1263.25
19,20,48.0,male,33.3,91,Yes,0,No,southeast,1391.53
20,21,45.0,male,23.2,85,Yes,0,No,southeast,1515.34
23,24,42.0,male,36.9,93,No,0,No,southeast,1534.30
...,...,...,...,...,...,...,...,...,...,...
1329,1330,52.0,female,37.7,109,Yes,0,Yes,southwest,48824.45
1333,1334,44.0,male,36.4,127,No,1,Yes,southwest,51194.56
1334,1335,43.0,male,32.8,125,No,0,Yes,southwest,52590.83
1335,1336,44.0,female,35.5,88,Yes,0,Yes,northwest,55135.40
1336,1337,59.0,female,38.1,120,No,1,Yes,northeast,58571.07

In [19]:
df2[df2["age"]>50] # select * from insurance where age>50

,PatientID,age,gender,bmi,bloodpressure,diabetic,children,smoker,region,claim
28,29,58.0,female,31.1,87,No,0,No,southeast,1621.88
33,34,52.0,female,36.9,81,No,0,No,southeast,1629.83
62,63,51.0,female,18.6,98,Yes,0,No,southwest,1728.90
63,64,60.0,female,20.6,90,No,0,No,southwest,1731.68
65,66,51.0,female,28.9,87,Yes,0,No,southwest,1743.21
...,...,...,...,...,...,...,...,...,...,...
1305,1306,57.0,female,46.2,96,No,0,Yes,southeast,45863.21
1312,1313,56.0,female,36.9,110,No,3,Yes,northwest,46661.44
1325,1326,52.0,female,36.4,133,Yes,1,Yes,northeast,48517.56
1329,1330,52.0,female,37.7,109,Yes,0,Yes,southwest,48824.45
1336,1337,59.0,female,38.1,120,No,1,Yes,northeast,58571.07

# Multiple condition:-

In [20]:
df2[(df2["age"]>50) & (df2["gender"] =="female")]

,PatientID,age,gender,bmi,bloodpressure,diabetic,children,smoker,region,claim
28,29,58.0,female,31.1,87,No,0,No,southeast,1621.88
33,34,52.0,female,36.9,81,No,0,No,southeast,1629.83
62,63,51.0,female,18.6,98,Yes,0,No,southwest,1728.90
63,64,60.0,female,20.6,90,No,0,No,southwest,1731.68
65,66,51.0,female,28.9,87,Yes,0,No,southwest,1743.21
...,...,...,...,...,...,...,...,...,...,...
1305,1306,57.0,female,46.2,96,No,0,Yes,southeast,45863.21
1312,1313,56.0,female,36.9,110,No,3,Yes,northwest,46661.44
1325,1326,52.0,female,36.4,133,Yes,1,Yes,northeast,48517.56
1329,1330,52.0,female,37.7,109,Yes,0,Yes,southwest,48824.45
1336,1337,59.0,female,38.1,120,No,1,Yes,northeast,58571.07

# Modifying Data:-

# Add a column:-

In [21]:
df2["age_plus_5"]=df2["age"]+5
df2.head()

,PatientID,age,gender,bmi,bloodpressure,diabetic,children,smoker,region,claim,age_plus_5
0,1,39.0,male,23.2,91,Yes,0,No,southeast,1121.87,44.0
1,2,24.0,male,30.1,87,No,0,No,southeast,1131.51,29.0
2,3,NaN,male,33.3,82,Yes,0,No,southeast,1135.94,NaN
3,4,NaN,male,33.7,80,No,0,No,northwest,1136.40,NaN
4,5,NaN,male,34.1,100,No,0,No,northwest,1137.01,NaN